
#1. Отредактируйте код, что бы он выводил текст Добро пожаловать!.
# данный код
print("Hello world")
# требуемый вывод:
# Добро пожаловать!


print("Добро пожаловать!")



#2. Допишите код, что бы получить вывод: Функция print().
# данный код
my_text=""
print(my_text)
# требуемый вывод:
# Функция print()


my_text="Функция print()"
print(my_text)

#3. Даны переменные name, surname и salary. Выведите требуемый текст.

# данный код
name = "Иван"
surname = "Петров"
salary = "90 000"
# требуемый вывод:
# Иван Петров зарабатывает 90 000 рублей

my_text_2=(name, surname, "зарабатывает", salary)
print(my_text_2)
print(name, surname, "зарабатывает", salary)

